In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
C -1.538536  1.630563  0.563261 -0.297451
D -0.391431  0.784998 -0.369340 -2.557645
E  1.012094  2.193151 -0.283718  0.403207

In [6]:
df['W']

A    1.263256
B    1.889349
C   -1.538536
D   -0.391431
E    1.012094
Name: W, dtype: float64

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
type(df['W'])

pandas.core.series.Series

In [10]:
df.W #like SQL

A    1.263256
B    1.889349
C   -1.538536
D   -0.391431
E    1.012094
Name: W, dtype: float64

In [11]:
df[['W','Z']]

          W         Z
A  1.263256 -2.121130
B  1.889349 -0.662438
C -1.538536 -0.297451
D -0.391431 -2.557645
E  1.012094  0.403207

In [13]:
#df['new']

In [24]:
df['new'] = df['W'] + df['Y']

In [25]:
df

          W         X         Y         Z       new
A  1.263256  1.437192  1.325507 -2.121130  2.588763
B  1.889349  1.862745  0.941731 -0.662438  2.831079
C -1.538536  1.630563  0.563261 -0.297451 -0.975275
D -0.391431  0.784998 -0.369340 -2.557645 -0.760771
E  1.012094  2.193151 -0.283718  0.403207  0.728376

In [26]:
#df.drop('new')

In [27]:
df.drop('new',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
C -1.538536  1.630563  0.563261 -0.297451
D -0.391431  0.784998 -0.369340 -2.557645
E  1.012094  2.193151 -0.283718  0.403207

In [29]:
df.drop('E')

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
C -1.538536  1.630563  0.563261 -0.297451
D -0.391431  0.784998 -0.369340 -2.557645

In [30]:
df.shape

(5, 4)

In [31]:
df

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
C -1.538536  1.630563  0.563261 -0.297451
D -0.391431  0.784998 -0.369340 -2.557645
E  1.012094  2.193151 -0.283718  0.403207

In [34]:
#ROWS RETURN

In [35]:
df

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
C -1.538536  1.630563  0.563261 -0.297451
D -0.391431  0.784998 -0.369340 -2.557645
E  1.012094  2.193151 -0.283718  0.403207

In [37]:
df.loc['C']

W   -1.538536
X    1.630563
Y    0.563261
Z   -0.297451
Name: C, dtype: float64

In [38]:
df.iloc[2]

W   -1.538536
X    1.630563
Y    0.563261
Z   -0.297451
Name: C, dtype: float64

In [39]:
df.loc['B','Y']

0.94173073375546312

In [40]:
df

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
C -1.538536  1.630563  0.563261 -0.297451
D -0.391431  0.784998 -0.369340 -2.557645
E  1.012094  2.193151 -0.283718  0.403207

In [41]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.263256  1.325507
B  1.889349  0.941731

In [42]:
#Conditional Selection

In [43]:
df

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
C -1.538536  1.630563  0.563261 -0.297451
D -0.391431  0.784998 -0.369340 -2.557645
E  1.012094  2.193151 -0.283718  0.403207

In [44]:
df > 0

       W     X      Y      Z
A   True  True   True  False
B   True  True   True  False
C  False  True   True  False
D  False  True  False  False
E   True  True  False   True

In [45]:
booldf = df > 0

In [46]:
booldf

       W     X      Y      Z
A   True  True   True  False
B   True  True   True  False
C  False  True   True  False
D  False  True  False  False
E   True  True  False   True

In [47]:
df[booldf]

          W         X         Y         Z
A  1.263256  1.437192  1.325507       NaN
B  1.889349  1.862745  0.941731       NaN
C       NaN  1.630563  0.563261       NaN
D       NaN  0.784998       NaN       NaN
E  1.012094  2.193151       NaN  0.403207

In [48]:
df[df>0]

          W         X         Y         Z
A  1.263256  1.437192  1.325507       NaN
B  1.889349  1.862745  0.941731       NaN
C       NaN  1.630563  0.563261       NaN
D       NaN  0.784998       NaN       NaN
E  1.012094  2.193151       NaN  0.403207

In [49]:
df

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
C -1.538536  1.630563  0.563261 -0.297451
D -0.391431  0.784998 -0.369340 -2.557645
E  1.012094  2.193151 -0.283718  0.403207

In [50]:
df['W']>0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [51]:
df['W']

A    1.263256
B    1.889349
C   -1.538536
D   -0.391431
E    1.012094
Name: W, dtype: float64

In [52]:
df[df['W']>0]

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
E  1.012094  2.193151 -0.283718  0.403207

In [53]:
df[df['Z']<0]

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
C -1.538536  1.630563  0.563261 -0.297451
D -0.391431  0.784998 -0.369340 -2.557645

In [54]:
df[df['Z']>0]

          W         X         Y         Z
E  1.012094  2.193151 -0.283718  0.403207

In [55]:
resultdf = df[df['W']>0]

In [56]:
resultdf

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
E  1.012094  2.193151 -0.283718  0.403207

In [57]:
resultdf['X']

A    1.437192
B    1.862745
E    2.193151
Name: X, dtype: float64

In [62]:
df[df['W']>0][['X','Y']]

          X         Y
A  1.437192  1.325507
B  1.862745  0.941731
E  2.193151 -0.283718

In [63]:
boolser = df['W']>0

In [64]:
boolser

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [65]:
result = df[boolser]

In [66]:
result

          W         X         Y         Z
A  1.263256  1.437192  1.325507 -2.121130
B  1.889349  1.862745  0.941731 -0.662438
E  1.012094  2.193151 -0.283718  0.403207

In [67]:
result[['Y','X']]

          Y         X
A  1.325507  1.437192
B  0.941731  1.862745
E -0.283718  2.193151